app/Models/Bill_model.php

SELECT *
FROM `unit_bill`
JOIN `unit_bill_breakup` ON `unit_bill_breakup`.`bill_id`=`unit_bill`.`id`
WHERE Month(unit_bill.created_at) = 9
---
    function billdetails() {
         $today=date("m")-1;
         $query = $this->db->table('unit_bill')->select('*')->join('unit_bill_breakup','unit_bill_breakup.bill_id=unit_bill.id')
                    ->where('Month(unit_bill.created_at)', $today)->get();