app/Models/Clients_model.php

    public function get_client($id = 0)    {
        if ($id === 0)  {
           /* $query = $this->db->select('*')
                    -> from ('tbl_client')
                                    ->join('tbl_ct_map_client_phone', 'tbl_client.id = tbl_ct_map_client_phone.client_id')
                                    ->join('tbl_ct_phone', 'tbl_ct_map_client_phone.phone_id = tbl_ct_phone.id') ->get();*/
            $query = $this->db->table('company')->select('*')
                                -> join('unit', 'unit.company_id = company.id') -> get();
---
SELECT *
FROM `company`
JOIN `unit` ON `unit`.`company_id` = `company`.`id`