app/Models/Employee_model.php

    public function getempdata($id = 0)    {
        if ($id === 0)  {
            $query = $this->db->table('applicant')->select('*')
                    ->join('employee', 'employee.appln_id = applicant.id')
                    ->join('map_ct_appln_phone', 'applicant.id = map_ct_appln_phone.appln_id')
                    ->join('phone', 'map_ct_appln_phone.phone_id = phone.id')
                  //  ->where('emp_type', 'Outsource')
                    ->get();
            return $query->getResultArray();
---
SELECT *
FROM `applicant`
JOIN `employee` ON `employee`.`appln_id` = `applicant`.`id`
JOIN `map_ct_appln_phone` ON `applicant`.`id` = `map_ct_appln_phone`.`appln_id`
JOIN `phone` ON `map_ct_appln_phone`.`phone_id` = `phone`.`id`