app/Models/Location_model.php

    public function getAllCountries() {
        $query=$this->db->table('country as c')->select('c.id as country_id,  c.code, c.name as country_name')->get();
---
SELECT `c`.`id` as `country_id`, `c`.`code`, `c`.`name` as `country_name`
FROM `country` as `c`

    public function getStates() {
        $query = $this->db->table('state as s')->select(array('s.id as state_id', 's.country_id', 's.name as state_name'))
                            ->where('s.country_id', $this->_countryID)->get();
---
SELECT `s`.`id` as `state_id`, `s`.`country_id`, `s`.`name` as `state_name`
FROM `state` as `s`
WHERE `s`.`country_id` = '98'