app/Models/Transaction_model.php

SELECT SUM(`amount`) AS `amount`
FROM `voucher`
WHERE `vouch_date` >= '0000-00-00'
AND `vouch_date` <= '2023-10-29 19:45:14'
SELECT `vouch_date`
FROM `voucher`
ORDER BY `vouch_date` ASC
 LIMIT 1
---
    public function vouchers($amount,$diff1,$diff2,$type) {
        $query = $this->db->table('voucher')->selectSum($amount)->where('vouch_date >=', $diff1)
                                            ->where('vouch_date <=', $diff2) ->get();
        return $query->getRow()->$amount;

SELECT SUM(`amount`) AS `amount`
FROM `receipts`
WHERE `created_at` = '2023-10-30'
---
    public function get_total_receipts($param=null) {
        $amount = 'amount';
        $today=date("Y-m-d");
        $query=$this->db->table('receipts')->selectSum('amount')->where('created_at ', $today)->get();

SELECT SUM(`amount`) AS `amount`
FROM `voucher`
WHERE `vouch_date` = '2023-10-30'
---
    public function get_total_vouchers($param=null) {
        $amount = 'amount';
        $today=date("Y-m-d");
        $query = $this->db->table('voucher')->selectSum('amount')->where('vouch_date ', $today)->get();

SELECT *
FROM `receipts`
WHERE `created_at` = '2023-10-30'
---
    public function get_receipts($param=null) {
        $today=date("Y-m-d");
        $query = $this->db->table('receipts')->select('*')->where('created_at ', $today)->get();

SELECT *
FROM `voucher`
WHERE `vouch_date` = '2023-10-30'
---
    public function get_vouchers($param=null) {
        $today=date("Y-m-d");
        $query = $this->db->table('voucher')->select('*')->where('vouch_date ', $today)->get();

SELECT *
FROM (SELECT `id_emp`, IFNULL( SUM( CASE WHEN DATE(t.created_at) = 2023-10-30 THEN added_sus END), 0) AS "ADDED TOTAL", IFNULL(SUM( CASE WHEN DATE(t.created_at) = 2023-10-30 THEN deducted_sus END), 0) AS "DEDUCTED TOTAL", ( IFNULL(SUM( CASE WHEN DATE(t.created_at) <= 2023-10-29 THEN added_sus END), 0) - IFNULL(SUM( CASE WHEN DATE(t.created_at) <= 2023-10-29 THEN deducted_sus END), 0)) AS "OPENING BAL", ( IFNULL(SUM(added_sus), 0) - IFNULL(SUM(deducted_sus), 0)) AS CLOSINGBAL, `n`.`first_name`, `n`.`last_name`, `n`.`photo`
FROM `map_emp_suspense` as `t`
JOIN `employee` ON `employee`.`id` = `t`.`id_emp`
JOIN `applicant` ON `applicant`.`id` = `employee`.`appln_id`
JOIN `name` as `n` ON `n`.`id` = `applicant`.`id_name`
GROUP BY `t`.`id_emp`) as y
WHERE CLOSINGBAL > 0 
GROUP BY `id_emp`
---
    public function get_all_suspense($param=null) {
        $today=date("Y-m-d");
        $yesterday=date('Y-m-d', strtotime("-1 days"));
        $where_clause = $this->db->table('map_emp_suspense as t')
                                ->select('id_emp,IFNULL( SUM( CASE WHEN DATE(t.created_at) = '.$today.
                                ' THEN added_sus END),0) AS "ADDED TOTAL",
                                 IFNULL(SUM( CASE WHEN DATE(t.created_at) = '
                                .$today.' THEN deducted_sus END),0) AS "DEDUCTED TOTAL",
                                ( IFNULL(SUM( CASE WHEN DATE(t.created_at) <= '.$yesterday.
                                ' THEN added_sus END),0) - IFNULL(SUM( CASE WHEN DATE(t.created_at) <= '.$yesterday.
                                ' THEN deducted_sus END),0)) AS "OPENING BAL",
                                ( IFNULL(SUM(added_sus),0) - IFNULL(SUM(deducted_sus),0)) AS CLOSINGBAL, n.first_name, n.last_name,n.photo')
                                 ->join('employee','employee.id = t.id_emp')
                                 ->join('applicant','applicant.id = employee.appln_id')
                                 ->join('name as n', 'n.id = applicant.id_name')
                                 ->groupBy('t.id_emp')
                                 ->getCompiledSelect();
        $query = $this->db-> table('('.$where_clause.') as y')->select('*')
                                    -> where("CLOSINGBAL > 0 ", NULL, FALSE)
                                    ->groupBy('id_emp')
                                    ->get();

SELECT *
FROM `tbl_acc_sal_adv_log`
JOIN `employee` ON `employee`.`id` = `tbl_acc_sal_adv_log`.`id_emp`
WHERE Date(tbl_acc_sal_adv_log.created_at) = '2023-10-30'
---
     public function get_emp_advance($param=null) {
        $today=date("Y-m-d");
        $query = $this->db->table('tbl_acc_sal_adv_log')->select('*')->join('employee','employee.id = tbl_acc_sal_adv_log.id_emp')
                    ->where('Date(tbl_acc_sal_adv_log.created_at)', $today)->get();